print("Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .")

a = input("Вставьте пропущенное слово: ") #нежной
b = input("Вставьте пропущенную букву: ") #е
c = input("Вставьте пропущенное слово: ") #толстой
d = input("Вставьте пропущенную букву: ") #е
e = input("Вставьте пропущенное слово: ") #тонкой
f = input("Вставьте пропущенное слово: ") #ребристая
g = input("Вставьте пропущенную букву: ") #и

print("Шляпка гриба, покрытая "+(a)+" кожиц"+(b)+"й, держится на "+(c)+" ножк"+(d)+". Снизу шляпка затянута "+(e)+" плёнкой. Когда её уберёшь, откроется нижняя "+(f)+" сторона шляпк"+(g)+".")