print("Шляпка гриба, … кожиц..й, держится … ножк.. . Снизу шляпка … плёнкой. Когда её уберёшь, откроется … сторона шляпк.. .")

a = input("Вставьте пропущенное слово: ") #покрытая
b = input("Вставьте пропущенную букву: ") #кожицей
c = input("Вставьте пропущенное слово: ") #на
d = input("Вставьте пропущенную букву: ") #ножке
e = input("Вставьте пропущенное слово: ") #затянута
f = input("Вставьте пропущенное слово: ") #нижняя
g = input("Вставьте пропущенную букву: ") #шляпки

print("Шляпка гриба,", (a), (b),", держится", (c), (d),". Снизу шляпка", (e),"плёнкой. Когда её уберёшь, откроется", (f),"сторона ", (g),".")