print("Шляпка гриба, … кожиц..й, держится … ножк.. . Снизу шляпка … плёнкой. Когда её уберёшь, откроется … сторона шляпк.. .")

a = input("Вставьте пропущенное слово: ") #покрытая
b = input("Вставьте пропущенную букву: ") #е
c = input("Вставьте пропущенное слово: ") #на
d = input("Вставьте пропущенную букву: ") #е
e = input("Вставьте пропущенное слово: ") #затянута
f = input("Вставьте пропущенное слово: ") #нижняя
g = input("Вставьте пропущенную букву: ") #и

print("Шляпка гриба,"+(a)+" кожиц"+(b)+"й, держится "+(c)+" ножк"+(d)+". Снизу шляпка "+(e)+" плёнкой. Когда её уберёшь, откроется "+(f)+" сторона шляпк"+(g)+".")